---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionCProfile
source: html/7b9f3c1e-ba92-8359-08ce-08e3eee0fa15.htm
---
# StructuralSectionCProfile Members

Creates a new instance of Structural Section C Profile shape with the associated set of parameters,
 used to attach to structural element.